#+title: 函数参数签名也支持模式匹配
函数参数签名也支持模式匹配，例如：
#+BEGIN_SRC rust
fn foo(mut v: [i32; 3]) -> [i32; 3] {
    v[0] = 3;
    v
}
fn main() {
    let v = [1, 3, 4];
    println!("{:?}", foo(v));
}
#+END_SRC

#+RESULTS:
: [3, 3, 4]

其中的 mut v 匹配 v ，相当于使用 let 将 v 重新声明成了可变绑定。
